Repository: aluvien/DSH-Anywhere-Connector
Catalog: ios/DSHAnywhere/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ is unreachable
zh_hans: %@ 无法连接

source: %lld operations
zh_hans: %lld 个操作

source: About
zh_hans: 关于

source: Active session
zh_hans: 活跃会话

source: Allow once
zh_hans: 允许一次

source: Archive
zh_hans: 归档

source: Archive session
zh_hans: 归档会话

source: Archived
zh_hans: 已归档

source: Ask
zh_hans: 询问

source: Ask every time
zh_hans: 每次都询问

source: Attach file
zh_hans: 添加文件

source: Attach photo
zh_hans: 添加图片

source: Attachments
zh_hans: 附件

source: Back
zh_hans: 返回

source: Bring a machine online to start a session.
zh_hans: 请先让设备上线，再开始会话。

source: By workspace
zh_hans: 按工作区

source: Camera unavailable
zh_hans: 相机不可用

source: Cancel
zh_hans: 取消

source: Changes the sandbox and approval policy for this session
zh_hans: 更改此会话的沙箱与审批策略

source: Choose model in new task
zh_hans: 在新任务中选择模型

source: Classic
zh_hans: 经典

source: Classic keeps the previous Happy-inspired session list.
zh_hans: 经典布局保留之前的 Happy 风格会话列表。

source: Close
zh_hans: 关闭

source: Close settings
zh_hans: 关闭设置

source: Code copied
zh_hans: 代码已复制

source: Collapse composer controls
zh_hans: 折叠编辑框操作

source: Collapse project
zh_hans: 收起项目

source: Command completed
zh_hans: 命令已完成

source: Command not found
zh_hans: 找不到该命令

source: Commands
zh_hans: 命令

source: Connect to DeepSeek Harness
zh_hans: 连接 DeepSeek Harness

source: Connected
zh_hans: 已连接

source: Connecting…
zh_hans: 正在连接…

source: Connection
zh_hans: 连接

source: Connection error
zh_hans: 连接错误

source: Connection failed
zh_hans: 连接失败

source: Context %lld percent used
zh_hans: 上下文已用 %lld 个百分点

source: Copied
zh_hans: 已复制

source: Copy
zh_hans: 复制

source: Copy code
zh_hans: 复制代码

source: Could not read that photo. If it is stored in iCloud, open it in Photos once so it downloads, then try again.
zh_hans: 无法读取这张照片。如果它存在 iCloud 中，请先在「照片」里打开一次让它下载，然后重试。

source: Create
zh_hans: 创建

source: Create your first Harness session.
zh_hans: 创建你的第一个 Harness 会话。

source: Created just now
zh_hans: 刚刚创建

source: Delete
zh_hans: 删除

source: Delete project
zh_hans: 删除项目

source: Delete this message?
zh_hans: 删除这条消息？

source: Devices
zh_hans: 设备

source: Devices paired to this Mac, as reported by the relay. Revoking one signs that device out immediately.
zh_hans: 已与此 Mac 配对的设备（由 relay 提供）。撤销会立即使该设备退出登录。

source: Disconnect
zh_hans: 断开连接

source: Disconnect this iPhone
zh_hans: 断开此 iPhone

source: Disconnect this iPhone?
zh_hans: 要断开此 iPhone 吗？

source: Disconnected
zh_hans: 已断开

source: Disconnecting removes the device token from this iPhone's keychain. The Mac keeps running.
zh_hans: 断开只会从本机钥匙串移除设备令牌，Mac 上的服务不受影响。

source: Done
zh_hans: 完成

source: Enter message…
zh_hans: 输入消息…

source: Enter the machine ID shown by DSH Anywhere Connector.
zh_hans: 请输入 DSH Anywhere Connector 显示的机器 ID。

source: Enter the pairing code or secret shown by DSH Anywhere Connector.
zh_hans: 请输入 DSH Anywhere Connector 显示的配对码或密钥。

source: Expand project
zh_hans: 展开项目

source: File
zh_hans: 文件

source: Filter and sort sessions
zh_hans: 筛选与排序会话

source: Filter sessions
zh_hans: 筛选会话

source: Flat list
zh_hans: 平铺列表

source: Follow System
zh_hans: 跟随系统

source: Follow System uses your device language. The choice applies immediately.
zh_hans: 「跟随系统」使用设备语言。选择会立即生效。

source: Full access
zh_hans: 完全访问

source: Group by project
zh_hans: 按项目分组

source: Group by workspace
zh_hans: 按工作区分组

source: Harness can modify files inside the selected workspace.
zh_hans: Harness 可以修改所选工作区内的文件。

source: Harness can read and modify files outside the workspace.
zh_hans: Harness 可以读取并修改工作区之外的文件。

source: Hide archived
zh_hans: 隐藏已归档

source: Hide reasoning
zh_hans: 收起思考过程

source: Home layout
zh_hans: 首页布局

source: Interface
zh_hans: 界面

source: is unreachable
zh_hans: 无法访问

source: Jump to latest output
zh_hans: 回到最新输出

source: Language
zh_hans: 语言

source: Loading tasks…
zh_hans: 正在加载任务…

source: Machine
zh_hans: 机器

source: Machine ID
zh_hans: 机器 ID

source: Machines
zh_hans: 机器

source: Mode
zh_hans: 模式

source: Model
zh_hans: 模型

source: More actions
zh_hans: 更多操作

source: My Mac
zh_hans: 我的 Mac

source: Never ask
zh_hans: 从不询问

source: New session
zh_hans: 新建会话

source: New session in
zh_hans: 在工作区中新建会话

source: New session in %@
zh_hans: 在 %@ 中新建会话

source: New task
zh_hans: 新建任务

source: New task in %@
zh_hans: 在 %@ 中新建任务

source: No approvals
zh_hans: 无需审批

source: No devices reported.
zh_hans: 暂无设备。

source: No messages yet
zh_hans: 暂无消息

source: No model catalog
zh_hans: 没有模型目录

source: No paired Macs yet.
zh_hans: 还没有配对的 Mac。

source: No sessions
zh_hans: 没有会话

source: No sessions yet
zh_hans: 暂无会话

source: No tasks yet
zh_hans: 暂无任务

source: No workspace
zh_hans: 不使用工作区

source: No workspace is available yet
zh_hans: 暂无可用工作区

source: Offline
zh_hans: 离线

source: OK
zh_hans: 好

source: Online
zh_hans: 在线

source: Or enter manually
zh_hans: 或手动输入

source: Or enter the details manually
zh_hans: 或手动输入机器信息

source: Other answer
zh_hans: 其他答案

source: Pair with Mac
zh_hans: 与 Mac 配对

source: Pairing another Mac adds it here instead of replacing the current one. Tap to switch, swipe to remove.
zh_hans: 配对第二台 Mac 会添加到这里，而不是替换当前设备。点按切换，左滑移除。

source: Pairing code or secret
zh_hans: 配对码或密钥

source: Permission
zh_hans: 权限

source: Permission confirmation required
zh_hans: 需要确认权限

source: Permission mode
zh_hans: 权限模式

source: Permission required
zh_hans: 需要权限

source: Permission: %@
zh_hans: 权限：%@

source: Photo
zh_hans: 图片

source: Plan, ask, build…
zh_hans: 规划、提问、构建…

source: Project options
zh_hans: 项目选项

source: Read only
zh_hans: 只读

source: Reasoning behind %lld answers in this turn
zh_hans: 本轮 %lld 条回答的思考过程

source: Reasoning behind this answer
zh_hans: 这条回答的思考过程

source: Reasoning effort
zh_hans: 思考深度

source: Reconnect to load available models.
zh_hans: 重新连接以加载可用模型。

source: Reconnecting (%lld)…
zh_hans: 正在重新连接（%lld）…

source: Refresh
zh_hans: 刷新

source: Refresh models
zh_hans: 刷新模型

source: Refresh project
zh_hans: 刷新项目

source: Refresh session info
zh_hans: 刷新会话信息

source: Reject
zh_hans: 拒绝

source: Remote
zh_hans: 远程

source: Remote shows projects and tasks in a native task browser.
zh_hans: Remote 布局以原生任务浏览器显示项目和任务。

source: Remote tasks
zh_hans: Remote 任务

source: Remove
zh_hans: 移除

source: Remove attachment
zh_hans: 移除附件

source: Rename project
zh_hans: 重命名项目

source: Revoke
zh_hans: 撤销

source: Run DSH Anywhere Connector on your Mac, then scan the pairing code it prints, or enter the machine details by hand.
zh_hans: 在 Mac 上运行 DSH Anywhere Connector，然后扫描它输出的配对码，或手动输入机器信息。

source: Running
zh_hans: 运行中

source: Scan pairing code
zh_hans: 扫描配对码

source: Scanning needs a physical iPhone with an available camera. Enter the machine details by hand instead.
zh_hans: 扫描需要一台带可用摄像头的真机 iPhone。请改为手动输入机器信息。

source: Select model
zh_hans: 选择模型

source: Send
zh_hans: 发送

source: Send a message, / command, @ file or conversation
zh_hans: 发送消息，/ 命令，@ 文件或会话

source: Send a prompt to your local DeepSeek Harness.
zh_hans: 向本机的 DeepSeek Harness 发送提示。

source: Send answer
zh_hans: 发送回答

source: Send message
zh_hans: 发送消息

source: Sending
zh_hans: 发送中

source: Session icon
zh_hans: 会话图标

source: Session settings
zh_hans: 会话设置

source: Sessions
zh_hans: 会话

source: Settings
zh_hans: 设置

source: Show archived
zh_hans: 显示已归档

source: Show message actions by default
zh_hans: 默认显示消息操作

source: Show reasoning
zh_hans: 查看思考过程

source: Show session usage
zh_hans: 显示会话用量

source: Show turn usage beside Thinking
zh_hans: 在“思考”旁显示本轮用量

source: Something went wrong
zh_hans: 出错了

source: Start a conversation
zh_hans: 开始对话

source: Start New Session
zh_hans: 新建会话

source: Start one on a connected machine.
zh_hans: 在已连接的设备上开始一个会话。

source: Status
zh_hans: 状态

source: Stop turn
zh_hans: 停止本轮

source: Task title (optional)
zh_hans: 任务标题（可选）

source: That is not a DSH Anywhere pairing code.
zh_hans: 这不是 DSH Anywhere 的配对码。

source: Thinking
zh_hans: 思考

source: This iPhone
zh_hans: 此 iPhone

source: This removes the message from this iPhone only. The original Harness history on your Mac is unchanged.
zh_hans: 只会从这台 iPhone 的会话视图中移除；Mac 上的 Harness 原始历史不会改变。

source: Took %lld hr %lld min
zh_hans: 用时 %lld时%lld分

source: Took %lld min
zh_hans: 用时 %lld分钟

source: Took %lld min %lld sec
zh_hans: 用时 %lld分钟%lld秒

source: Took %lld sec
zh_hans: 用时 %lld秒

source: Tool %@, %@
zh_hans: 工具 %@，%@

source: Troubleshoot
zh_hans: 排查连接

source: Type your answer
zh_hans: 输入你的答案

source: Unarchive
zh_hans: 取消归档

source: Unrecognised code %@
zh_hans: 无法识别的码 %@

source: Untitled session
zh_hans: 未命名会话

source: Version
zh_hans: 版本

source: Workspace
zh_hans: 工作区

source: Workspace changes
zh_hans: 允许改动工作区

source: Workspace menu
zh_hans: 工作区菜单

source: Workspace write
zh_hans: 工作区可写

source: You will need the Mac's machine ID and pairing secret to pair again.
zh_hans: 重新配对需要该 Mac 的机器 ID 与配对密钥。

source: Your API keys stay on your Mac.
zh_hans: 你的 API key 只保存在 Mac 上。
